In [19]:
import pandas as pd
import numpy as np

Importar valores desde un csv

In [20]:
df = pd.read_csv("personas_sucio.csv")

SELECT Y FILTRADO DE VALORES

In [8]:
df["edad"]

0             25
1             30
2            NaN
3     veintiocho
4             22
5             25
6            27
7             29
8            NaN
9            31
10            35
11           NaN
12       treinta
13            28
14            33
15            27
16            40
17           NaN
18            19
19            25
Name: edad, dtype: object

In [12]:
df.sort_values(by="edad")

     nombre        edad     ciudad               email fecha_registro
19   Teresa          25   Sevilla     teresa@ mail.com     2024-02-20
6     Sofia         27     sevilla                 NaN     2024-05-20
16  Alberto          40   Valencia    alberto@mail.com     2024/06/12
18    Pablo          19     MADRID       pablo@mailcom     2024-05-30
4     lucía          22     Madrid   lucia@example.com      2024-3-05
0     Ana            25    madrid      ana@example.com     2024-01-10
5       ANA          25        MAD     ana@example.com     2024/01/10
15   Isabel          27       Sev.     isabel@mail.com     2024-03-10
13     Eva           28  barcelona         eva@example     2024-04-05
7    Miguel          29        Sev     miguel@mail.com     2024-06-01
1      Luis          30    Sevilla    luis(at)mail.com     10/01/2024
9     Laura         31    Valéncia   laura@example.com     2024-07-10
14   Daniel          33     Madrid  daniel@example.com     2024-02-29
10  Antonio          35     Madrid    antonio@mail.com     2023-11-25
12     Raúl     treinta   Valencia   raul@@example.com     2024-05-12
3    Pedro   veintiocho  Barcelona    pedroexample.com            NaN
2     Marta         NaN   VALENCIA   marta@example.com     2024-02-15
8      Juan         NaN     madrid      juan@@mail.com     2024-02-30
11    María         NaN    Sevilla      maria@mail.com     2024-01-15
17   Carmen         NaN   Valéncia  carmen@example.com     2024-07-01

In [13]:
df.head()

   nombre        edad     ciudad              email fecha_registro
0   Ana            25    madrid     ana@example.com     2024-01-10
1    Luis          30    Sevilla   luis(at)mail.com     10/01/2024
2   Marta         NaN   VALENCIA  marta@example.com     2024-02-15
3  Pedro   veintiocho  Barcelona   pedroexample.com            NaN
4   lucía          22     Madrid  lucia@example.com      2024-3-05

In [14]:
df.tail()

     nombre edad    ciudad               email fecha_registro
15   Isabel   27      Sev.     isabel@mail.com     2024-03-10
16  Alberto   40  Valencia    alberto@mail.com     2024/06/12
17   Carmen  NaN  Valéncia  carmen@example.com     2024-07-01
18    Pablo   19    MADRID       pablo@mailcom     2024-05-30
19   Teresa   25  Sevilla     teresa@ mail.com     2024-02-20

In [15]:
df.shape

(20, 5)

In [16]:
df.size

100

In [17]:
df.columns

Index(['nombre', 'edad', 'ciudad', 'email', 'fecha_registro'], dtype='object')

In [18]:
df.shape
df.size
df.columns

Index(['nombre', 'edad', 'ciudad', 'email', 'fecha_registro'], dtype='object')

In [21]:
df["edad"] = df["edad"].fillna(0)

In [22]:
df["edad"]

0             25
1             30
2              0
3     veintiocho
4             22
5             25
6            27
7             29
8              0
9            31
10            35
11             0
12       treinta
13            28
14            33
15            27
16            40
17             0
18            19
19            25
Name: edad, dtype: object

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
import re

In [7]:
df = pd.read_csv("personas_sucio.csv")

In [8]:
df.head()

   nombre        edad     ciudad              email fecha_registro
0   Ana            25    madrid     ana@example.com     2024-01-10
1    Luis          30    Sevilla   luis(at)mail.com     10/01/2024
2   Marta         NaN   VALENCIA  marta@example.com     2024-02-15
3  Pedro   veintiocho  Barcelona   pedroexample.com            NaN
4   lucía          22     Madrid  lucia@example.com      2024-3-05

In [9]:
df = df.dropna()

In [10]:
df.head()

   nombre edad   ciudad              email fecha_registro
0   Ana     25  madrid     ana@example.com     2024-01-10
1    Luis   30  Sevilla   luis(at)mail.com     10/01/2024
4   lucía   22   Madrid  lucia@example.com      2024-3-05
5     ANA   25      MAD    ana@example.com     2024/01/10
7  Miguel   29      Sev    miguel@mail.com     2024-06-01

In [11]:
df.sort_values(by="edad")

     nombre     edad     ciudad               email fecha_registro
19   Teresa       25   Sevilla     teresa@ mail.com     2024-02-20
16  Alberto       40   Valencia    alberto@mail.com     2024/06/12
18    Pablo       19     MADRID       pablo@mailcom     2024-05-30
4     lucía       22     Madrid   lucia@example.com      2024-3-05
0     Ana         25    madrid      ana@example.com     2024-01-10
5       ANA       25        MAD     ana@example.com     2024/01/10
15   Isabel       27       Sev.     isabel@mail.com     2024-03-10
13     Eva        28  barcelona         eva@example     2024-04-05
7    Miguel       29        Sev     miguel@mail.com     2024-06-01
1      Luis       30    Sevilla    luis(at)mail.com     10/01/2024
9     Laura      31    Valéncia   laura@example.com     2024-07-10
14   Daniel       33     Madrid  daniel@example.com     2024-02-29
10  Antonio       35     Madrid    antonio@mail.com     2023-11-25
12     Raúl  treinta   Valencia   raul@@example.com     2024-05-12

In [16]:
df['nombre'] = df['nombre'].str.title()

In [17]:
df.sort_values(by="edad")

     nombre     edad     ciudad               email fecha_registro
19   Teresa       25   Sevilla     teresa@ mail.com     2024-02-20
16  Alberto       40   Valencia    alberto@mail.com     2024/06/12
18    Pablo       19     MADRID       pablo@mailcom     2024-05-30
4     Lucía       22     Madrid   lucia@example.com      2024-3-05
0     Ana         25    madrid      ana@example.com     2024-01-10
5       Ana       25        MAD     ana@example.com     2024/01/10
15   Isabel       27       Sev.     isabel@mail.com     2024-03-10
13     Eva        28  barcelona         eva@example     2024-04-05
7    Miguel       29        Sev     miguel@mail.com     2024-06-01
1      Luis       30    Sevilla    luis(at)mail.com     10/01/2024
9     Laura      31    Valéncia   laura@example.com     2024-07-10
14   Daniel       33     Madrid  daniel@example.com     2024-02-29
10  Antonio       35     Madrid    antonio@mail.com     2023-11-25
12     Raúl  treinta   Valencia   raul@@example.com     2024-05-12

In [18]:
df['edad'] = pd.to_numeric(df['edad'], errors='coerce')

In [19]:
media_edad = df.loc[df['edad'] > 0, 'edad'].mean()

In [20]:
df['edad'] = df['edad'].replace(0, np.nan)

In [21]:
df['edad'] = df['edad'].fillna(media_edad)

In [22]:
df.sort_values(by="edad")

     nombre       edad     ciudad               email fecha_registro
18    Pablo  19.000000     MADRID       pablo@mailcom     2024-05-30
4     Lucía  22.000000     Madrid   lucia@example.com      2024-3-05
0     Ana    25.000000    madrid      ana@example.com     2024-01-10
5       Ana  25.000000        MAD     ana@example.com     2024/01/10
19   Teresa  25.000000   Sevilla     teresa@ mail.com     2024-02-20
15   Isabel  27.000000       Sev.     isabel@mail.com     2024-03-10
13     Eva   28.000000  barcelona         eva@example     2024-04-05
12     Raúl  28.384615   Valencia   raul@@example.com     2024-05-12
7    Miguel  29.000000        Sev     miguel@mail.com     2024-06-01
1      Luis  30.000000    Sevilla    luis(at)mail.com     10/01/2024
9     Laura  31.000000   Valéncia   laura@example.com     2024-07-10
14   Daniel  33.000000     Madrid  daniel@example.com     2024-02-29
10  Antonio  35.000000     Madrid    antonio@mail.com     2023-11-25
16  Alberto  40.000000   Valencia    alberto@mail.com     2024/06/12

In [23]:
df = pd.read_csv("personas_sucio.csv")

In [24]:
df.sort_values(by="edad")

     nombre        edad     ciudad               email fecha_registro
19   Teresa          25   Sevilla     teresa@ mail.com     2024-02-20
6     Sofia         27     sevilla                 NaN     2024-05-20
16  Alberto          40   Valencia    alberto@mail.com     2024/06/12
18    Pablo          19     MADRID       pablo@mailcom     2024-05-30
4     lucía          22     Madrid   lucia@example.com      2024-3-05
0     Ana            25    madrid      ana@example.com     2024-01-10
5       ANA          25        MAD     ana@example.com     2024/01/10
15   Isabel          27       Sev.     isabel@mail.com     2024-03-10
13     Eva           28  barcelona         eva@example     2024-04-05
7    Miguel          29        Sev     miguel@mail.com     2024-06-01
1      Luis          30    Sevilla    luis(at)mail.com     10/01/2024
9     Laura         31    Valéncia   laura@example.com     2024-07-10
14   Daniel          33     Madrid  daniel@example.com     2024-02-29
10  Antonio          35     Madrid    antonio@mail.com     2023-11-25
12     Raúl     treinta   Valencia   raul@@example.com     2024-05-12
3    Pedro   veintiocho  Barcelona    pedroexample.com            NaN
2     Marta         NaN   VALENCIA   marta@example.com     2024-02-15
8      Juan         NaN     madrid      juan@@mail.com     2024-02-30
11    María         NaN    Sevilla      maria@mail.com     2024-01-15
17   Carmen         NaN   Valéncia  carmen@example.com     2024-07-01

In [25]:
df['nombre'] = df['nombre'].str.title()

In [26]:
df['edad'] = pd.to_numeric(df['edad'], errors='coerce')

In [27]:
media_edad = df.loc[df['edad'] > 0, 'edad'].mean()

In [28]:
df.sort_values(by="edad")

     nombre  edad     ciudad               email fecha_registro
18    Pablo  19.0     MADRID       pablo@mailcom     2024-05-30
4     Lucía  22.0     Madrid   lucia@example.com      2024-3-05
0     Ana    25.0    madrid      ana@example.com     2024-01-10
5       Ana  25.0        MAD     ana@example.com     2024/01/10
19   Teresa  25.0   Sevilla     teresa@ mail.com     2024-02-20
6     Sofia  27.0    sevilla                 NaN     2024-05-20
15   Isabel  27.0       Sev.     isabel@mail.com     2024-03-10
13     Eva   28.0  barcelona         eva@example     2024-04-05
7    Miguel  29.0        Sev     miguel@mail.com     2024-06-01
1      Luis  30.0    Sevilla    luis(at)mail.com     10/01/2024
9     Laura  31.0   Valéncia   laura@example.com     2024-07-10
14   Daniel  33.0     Madrid  daniel@example.com     2024-02-29
10  Antonio  35.0     Madrid    antonio@mail.com     2023-11-25
16  Alberto  40.0   Valencia    alberto@mail.com     2024/06/12
2     Marta   NaN   VALENCIA   marta@example.com     2024-02-15
3    Pedro    NaN  Barcelona    pedroexample.com            NaN
8      Juan   NaN     madrid      juan@@mail.com     2024-02-30
11    María   NaN    Sevilla      maria@mail.com     2024-01-15
12     Raúl   NaN   Valencia   raul@@example.com     2024-05-12
17   Carmen   NaN   Valéncia  carmen@example.com     2024-07-01

In [30]:
df['edad'] = df['edad'].replace(0, np.nan)

In [31]:
df['edad'] = df['edad'].fillna(media_edad)

In [32]:
df.sort_values(by="edad")

     nombre       edad     ciudad               email fecha_registro
18    Pablo  19.000000     MADRID       pablo@mailcom     2024-05-30
4     Lucía  22.000000     Madrid   lucia@example.com      2024-3-05
0     Ana    25.000000    madrid      ana@example.com     2024-01-10
5       Ana  25.000000        MAD     ana@example.com     2024/01/10
19   Teresa  25.000000   Sevilla     teresa@ mail.com     2024-02-20
6     Sofia  27.000000    sevilla                 NaN     2024-05-20
15   Isabel  27.000000       Sev.     isabel@mail.com     2024-03-10
13     Eva   28.000000  barcelona         eva@example     2024-04-05
2     Marta  28.285714   VALENCIA   marta@example.com     2024-02-15
8      Juan  28.285714     madrid      juan@@mail.com     2024-02-30
11    María  28.285714    Sevilla      maria@mail.com     2024-01-15
12     Raúl  28.285714   Valencia   raul@@example.com     2024-05-12
17   Carmen  28.285714   Valéncia  carmen@example.com     2024-07-01
3    Pedro   28.285714  Barcelona    pedroexample.com            NaN
7    Miguel  29.000000        Sev     miguel@mail.com     2024-06-01
1      Luis  30.000000    Sevilla    luis(at)mail.com     10/01/2024
9     Laura  31.000000   Valéncia   laura@example.com     2024-07-10
14   Daniel  33.000000     Madrid  daniel@example.com     2024-02-29
10  Antonio  35.000000     Madrid    antonio@mail.com     2023-11-25
16  Alberto  40.000000   Valencia    alberto@mail.com     2024/06/12

In [33]:
df['ciudad'] = df['ciudad'].str.upper()

In [34]:
df.sort_values(by="edad")

     nombre       edad     ciudad               email fecha_registro
18    Pablo  19.000000     MADRID       pablo@mailcom     2024-05-30
4     Lucía  22.000000     MADRID   lucia@example.com      2024-3-05
0     Ana    25.000000    MADRID      ana@example.com     2024-01-10
5       Ana  25.000000        MAD     ana@example.com     2024/01/10
19   Teresa  25.000000   SEVILLA     teresa@ mail.com     2024-02-20
6     Sofia  27.000000    SEVILLA                 NaN     2024-05-20
15   Isabel  27.000000       SEV.     isabel@mail.com     2024-03-10
13     Eva   28.000000  BARCELONA         eva@example     2024-04-05
2     Marta  28.285714   VALENCIA   marta@example.com     2024-02-15
8      Juan  28.285714     MADRID      juan@@mail.com     2024-02-30
11    María  28.285714    SEVILLA      maria@mail.com     2024-01-15
12     Raúl  28.285714   VALENCIA   raul@@example.com     2024-05-12
17   Carmen  28.285714   VALÉNCIA  carmen@example.com     2024-07-01
3    Pedro   28.285714  BARCELONA    pedroexample.com            NaN
7    Miguel  29.000000        SEV     miguel@mail.com     2024-06-01
1      Luis  30.000000    SEVILLA    luis(at)mail.com     10/01/2024
9     Laura  31.000000   VALÉNCIA   laura@example.com     2024-07-10
14   Daniel  33.000000     MADRID  daniel@example.com     2024-02-29
10  Antonio  35.000000     MADRID    antonio@mail.com     2023-11-25
16  Alberto  40.000000   VALENCIA    alberto@mail.com     2024/06/12

In [36]:
df['fecha_registro'] = pd.to_datetime(df['fecha_registro'], errors='coerce')

In [37]:
df['fecha_registro'] = df['fecha_registro'].dt.strftime('%d/%m/%Y')

In [39]:
df.sort_values(by="nombre")

     nombre       edad     ciudad               email fecha_registro
6     Sofia  27.000000    SEVILLA                 NaN     20/05/2024
0     Ana    25.000000    MADRID      ana@example.com     10/01/2024
17   Carmen  28.285714   VALÉNCIA  carmen@example.com     01/07/2024
16  Alberto  40.000000   VALENCIA    alberto@mail.com            NaN
5       Ana  25.000000        MAD     ana@example.com            NaN
10  Antonio  35.000000     MADRID    antonio@mail.com     25/11/2023
14   Daniel  33.000000     MADRID  daniel@example.com     29/02/2024
13     Eva   28.000000  BARCELONA         eva@example     05/04/2024
15   Isabel  27.000000       SEV.     isabel@mail.com     10/03/2024
8      Juan  28.285714     MADRID      juan@@mail.com            NaN
9     Laura  31.000000   VALÉNCIA   laura@example.com     10/07/2024
4     Lucía  22.000000     MADRID   lucia@example.com     05/03/2024
1      Luis  30.000000    SEVILLA    luis(at)mail.com            NaN
2     Marta  28.285714   VALENCIA   marta@example.com     15/02/2024
11    María  28.285714    SEVILLA      maria@mail.com     15/01/2024
7    Miguel  29.000000        SEV     miguel@mail.com     01/06/2024
18    Pablo  19.000000     MADRID       pablo@mailcom     30/05/2024
3    Pedro   28.285714  BARCELONA    pedroexample.com            NaN
12     Raúl  28.285714   VALENCIA   raul@@example.com     12/05/2024
19   Teresa  25.000000   SEVILLA     teresa@ mail.com     20/02/2024

In [41]:
def validar_email(email):
    patron = r'^[\w\.-]+@[\w\.-]+\.\w+$'
    if re.match(patron, str(email)):
        return email
    else:
        return np.nan  # Dejar en NaN si no cumple

df['email'] = df['email'].apply(validar_email)

In [42]:
df.sort_values(by="nombre")

     nombre       edad     ciudad               email fecha_registro
6     Sofia  27.000000    SEVILLA                 NaN     20/05/2024
0     Ana    25.000000    MADRID      ana@example.com     10/01/2024
17   Carmen  28.285714   VALÉNCIA  carmen@example.com     01/07/2024
16  Alberto  40.000000   VALENCIA    alberto@mail.com            NaN
5       Ana  25.000000        MAD     ana@example.com            NaN
10  Antonio  35.000000     MADRID    antonio@mail.com     25/11/2023
14   Daniel  33.000000     MADRID  daniel@example.com     29/02/2024
13     Eva   28.000000  BARCELONA                 NaN     05/04/2024
15   Isabel  27.000000       SEV.     isabel@mail.com     10/03/2024
8      Juan  28.285714     MADRID                 NaN            NaN
9     Laura  31.000000   VALÉNCIA   laura@example.com     10/07/2024
4     Lucía  22.000000     MADRID   lucia@example.com     05/03/2024
1      Luis  30.000000    SEVILLA                 NaN            NaN
2     Marta  28.285714   VALENCIA   marta@example.com     15/02/2024
11    María  28.285714    SEVILLA      maria@mail.com     15/01/2024
7    Miguel  29.000000        SEV     miguel@mail.com     01/06/2024
18    Pablo  19.000000     MADRID                 NaN     30/05/2024
3    Pedro   28.285714  BARCELONA                 NaN            NaN
12     Raúl  28.285714   VALENCIA                 NaN     12/05/2024
19   Teresa  25.000000   SEVILLA                  NaN     20/02/2024

In [43]:
df = df.dropna(subset=['email'])

In [45]:
df.sort_values(by="nombre")

     nombre       edad    ciudad               email fecha_registro
0     Ana    25.000000   MADRID      ana@example.com     10/01/2024
17   Carmen  28.285714  VALÉNCIA  carmen@example.com     01/07/2024
16  Alberto  40.000000  VALENCIA    alberto@mail.com            NaN
5       Ana  25.000000       MAD     ana@example.com            NaN
10  Antonio  35.000000    MADRID    antonio@mail.com     25/11/2023
14   Daniel  33.000000    MADRID  daniel@example.com     29/02/2024
15   Isabel  27.000000      SEV.     isabel@mail.com     10/03/2024
9     Laura  31.000000  VALÉNCIA   laura@example.com     10/07/2024
4     Lucía  22.000000    MADRID   lucia@example.com     05/03/2024
2     Marta  28.285714  VALENCIA   marta@example.com     15/02/2024
11    María  28.285714   SEVILLA      maria@mail.com     15/01/2024
7    Miguel  29.000000       SEV     miguel@mail.com     01/06/2024

In [25]:
df = df.dropna()

In [26]:
import pandas as pd

In [27]:
import numpy as np

In [28]:
df = pd.read_csv("personas_sucio.csv")

In [29]:
df['nombre'] = df['nombre'].str.title()

In [30]:
df['edad'] = pd.to_numeric(df['edad'], errors='coerce')

In [31]:
df['edad'] = pd.to_numeric(df['edad'], errors='coerce')
media_edad = df['edad'].replace(0, np.nan).mean()
df['edad'] = df['edad'].replace(0, np.nan).fillna(media_edad).astype(int)

In [32]:
df['ciudad'] = df['ciudad'].str.upper()

In [35]:
df['email'] = df['email'].astype(str).str.strip()
patron_email = r'^[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,}$'
df.loc[~df['email'].str.match(patron_email, na=False), 'email'] = 'desconocido@correo.com'

In [38]:
df['fecha_registro'] = pd.to_datetime(df['fecha_registro'], errors='coerce', dayfirst=True)
df['fecha_registro'] = df['fecha_registro'].fillna(pd.Timestamp.now())
df['fecha_registro'] = df['fecha_registro'].dt.strftime('%d/%m/%Y')

In [40]:
df.to_csv("datos_limpios.csv", index=False)